app/controllers/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "active", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Mike"], ["description", "horse"], ["price", "10.0"], ["active", "t"], ["user_id", 1], ["created_at", "2016-08-24 18:18:02.379972"], ["updated_at", "2016-08-24 18:18:02.379972"]]
---
  def create
    personal_params = product_params.merge(user_id: current_user.id)
    @product = Product.new(personal_params)

    respond_to do |format|
      if @product.save